<a href="https://colab.research.google.com/github/RsdTanmoy/Machine-Learning-Pandas/blob/main/Pandas_Lecture_14(Pivot_Table).ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

**Pandas Pivot Table**

In [ ]:
from google.colab import drive
drive.mount('/content/gdrive')

Mounted at /content/gdrive

In [ ]:
import pandas as pd
df=pd.read_csv('/content/gdrive/MyDrive/Pandas/Movie_ratings - Sheet1.csv')
df

       Genre  Year  Budget(M$)  Ratings%
0     Action  2008          28        48
1     Action  2009         200        63
2     Action  2008          32        57
3     Action  2010          20        52
4  Adventure  2009          18        84
5  Adventure  2010         105        44
6     Comedy  2010          20        70
7     Comedy  2009           8        81
8     Comedy  2008          30        71

In [ ]:
df.pivot_table(index='Genre')

           Budget(M$)  Ratings%     Year
Genre
Action      70.000000        55  2008.75
Adventure   61.500000        64  2009.50
Comedy      19.333333        74  2009.00

In [ ]:
df.pivot_table(index='Genre',columns='Year')

          Budget(M$)               Ratings%
Year            2008   2009   2010     2008  2009  2010
Genre
Action          30.0  200.0   20.0     52.5  63.0  52.0
Adventure        NaN   18.0  105.0      NaN  84.0  44.0
Comedy          30.0    8.0   20.0     71.0  81.0  70.0

In [ ]:
df.pivot_table(index='Genre',columns='Year',aggfunc='count')

          Budget(M$)           Ratings%
Year            2008 2009 2010     2008 2009 2010
Genre
Action           2.0  1.0  1.0      2.0  1.0  1.0
Adventure        NaN  1.0  1.0      NaN  1.0  1.0
Comedy           1.0  1.0  1.0      1.0  1.0  1.0

In [ ]:
df.pivot_table(index='Genre',columns='Year',aggfunc='max')

          Budget(M$)               Ratings%
Year            2008   2009   2010     2008  2009  2010
Genre
Action          32.0  200.0   20.0     57.0  63.0  52.0
Adventure        NaN   18.0  105.0      NaN  84.0  44.0
Comedy          30.0    8.0   20.0     71.0  81.0  70.0

In [ ]:
df.pivot_table(index='Genre',columns='Year',aggfunc='sum')

          Budget(M$)               Ratings%
Year            2008   2009   2010     2008  2009  2010
Genre
Action          60.0  200.0   20.0    105.0  63.0  52.0
Adventure        NaN   18.0  105.0      NaN  84.0  44.0
Comedy          30.0    8.0   20.0     71.0  81.0  70.0

In [ ]:
df.pivot_table(index='Genre',columns='Year', fill_value=0)

          Budget(M$)           Ratings%
Year            2008 2009 2010     2008 2009 2010
Genre
Action            30  200   20     52.5   63   52
Adventure          0   18  105      0.0   84   44
Comedy            30    8   20     71.0   81   70

In [ ]:
df.pivot_table(index='Genre',columns='Year',fill_value=0, margins=True)

          Budget(M$)                          ... Ratings%
Year            2008        2009        2010  ...     2009       2010        All
Genre                                         ...
Action            30  200.000000   20.000000  ...       63  52.000000  55.000000
Adventure          0   18.000000  105.000000  ...       84  44.000000  64.000000
Comedy            30    8.000000   20.000000  ...       81  70.000000  74.000000
All               30   75.333333   48.333333  ...       76  55.333333  63.333333

[4 rows x 8 columns]

In [ ]:
df.pivot_table(index='Genre',columns='Year',aggfunc='sum',fill_value=0, margins=True)

          Budget(M$)                Ratings%
Year            2008 2009 2010  All     2008 2009 2010  All
Genre
Action            60  200   20  280      105   63   52  220
Adventure          0   18  105  123        0   84   44  128
Comedy            30    8   20   58       71   81   70  222
All               90  226  145  461      176  228  166  570